void main() {
  task1();  
  task2();
}
/// Завдання 1: Математичні оператори
/// Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
///
/// Обчисліть площу і периметр прямокутника.
/// Виведіть площу і периметр.
/// Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
void task1() {
 final width = 18.4;
 final height = 30.9;

 final area = width * height;
 final perimeter = 2 * (width + height);

 final squares = area ~/ 1;

 print('Площа прямокутника $area');
 print('Периметр прямокутника $perimeter');
 print('Кількість повних квадратів 1x1: $squares');
 print('______________________________________________');
}
/// Завдання 2: Оператори порівняння
/// Створіть змінну number.
///
/// Перевірте:
/// Чи більше число за 50.
/// Чи менше число за 100.
/// Чи ділиться число на 5 без залишку.
/// Виведіть всі результати.
void task2() {  
  var number = 75;  
  bool isGreaterThan50 = number > 50;  
  bool isLessThan100 = number < 100;  
  bool isDivisibleBy5 = number % 5 == 0;

  print('Число: $number');
  print('Чи більше за 50? $isGreaterThan50');
  print('Чи менше за 100? $isLessThan100');
  print('Чи ділиться на 5 без залишку? $isDivisibleBy5');
  print('______________________________________________');
}