void main() {
  task1();  
}
/// Завдання 1: Математичні оператори
/// Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
///
/// Обчисліть площу і периметр прямокутника.
/// Виведіть площу і периметр.
/// Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
void task1() {
 final width = 18.4;
 final height = 30.9;

 final area = width * height;
 final perimeter = 2 * (width + height);

 final squares = area ~/ 1;

 print('Площа прямокутника $area');
 print('Периметр прямокутника $perimeter');
 print('Кількість повних квадратів 1x1: $squares');
}